
function getCoordinatesForButtons(index) {
    // 서울의 구별 중심 좌표 배열

 
 function getCoordinatesForButtons(index) {
   

    const coordinates = [
        { lat: '37.4959854', lng: '127.0664091' }, // 강남구
        { lat: '37.5492077', lng: '127.1464824' }, // 강동구
        { lat: '37.6469954', lng: '127.0147158' }, // 강북구
        { lat: '37.5657617', lng: '126.8226561' }, // 강서구
        { lat: '37.4603732', lng: '126.9536086' }, // 관악구
        { lat: '37.5574120', lng: '127.0796211' }, // 광진구
        { lat: '37.4954856', lng: '126.858121'  }, // 구로구
        { lat: '37.4600969', lng: '126.9001546' }, // 금천구
        { lat: '37.6377533', lng: '127.0754623' }, // 노원구
        { lat: '37.6658609', lng: '127.0317674' }, // 도봉구
        { lat: '37.5838012', lng: '127.0507003' }, // 동대문구
        { lat: '37.4965037', lng: '126.9443073' }, // 동작구
        { lat: '37.5676507', lng: '126.8854549' }, // 마포구
        { lat: '37.5820369', lng: '126.9356665' }, // 서대문구
        { lat: '37.4769528', lng: '127.0378103' }, // 서초구
        { lat: '37.5506753', lng: '127.0409622' }, // 성동구
        { lat: '37.606991',  lng: '127.0232185' }, // 성북구
        { lat: '37.5177941', lng: '127.1127078' }, // 송파구
        { lat: '37.5270616', lng: '126.8561534' }, // 양천구
        { lat: '37.520641',  lng: '126.9139242' }, // 영등포구
        { lat: '37.5311008', lng: '126.9810742' }, // 용산구
        { lat: '37.6176125', lng: '126.9227004' }, // 은평구
        { lat: '37.5990998', lng: '126.9861493' }, // 종로구
        { lat: '37.5579452', lng: '126.9941904' }, // 중구
        { lat: '37.598031',  lng: '127.092931'  }  // 중랑구
    ];

    // 지정된 인덱스의 좌표를 반환
    return {
        latitude: coordinates[index].lat,
        longitude: coordinates[index].lng
    };
}
